tonyhoangdev/stm/examples/STM8S103F/demo_apps/timer1_input_capture/main.c
/**
 ******************************************************************************
 * @file    Project/main.c
 * @author  MCD Application Team
 * @version V2.2.0
 * @date    30-September-2014
 * @brief   Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "stm8s_clk.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint32_t TIM1ClockFreq = 2000000;
__IO uint32_t LSIClockFreq = 0, duty = 0;
uint16_t ICValue1 =0, ICValue2 =0, ICValue3 = 0, ICValue4 = 0;

/* Private function prototypes -----------------------------------------------*/
static void TIM1_Config(void);
/* Private functions ---------------------------------------------------------*/

void main(void)
{
    /* Connect LSI to COO pin*/
    GPIO_Init(GPIOB, GPIO_PIN_5, GPIO_MODE_OUT_PP_LOW_FAST);
    //CLK_CCOConfig(CLK_OUTPUT_CPUDIV32);
    //CLK_CCOCmd(ENABLE);

    /* TIM1 configuration -----------------------------------------*/
    TIM1_Config();

    /* Compute LSI clock frequency */
    LSIClockFreq = (8 * TIM1ClockFreq) / (ICValue2 - ICValue1);
    duty = 100 * (ICValue3 - ICValue1) / (ICValue2 - ICValue1);

    /* Infinite loop */
    while (1)
    {

    }
}

static void TIM1_Config(void)
{
    TIM1_ICInit(TIM1_CHANNEL_3, TIM1_ICPOLARITY_FALLING, TIM1_ICSELECTION_DIRECTTI,
                TIM1_ICPSC_DIV8, 0x0);

    TIM1_ICInit(TIM1_CHANNEL_4, TIM1_ICPOLARITY_RISING, TIM1_ICSELECTION_DIRECTTI,
                TIM1_ICPSC_DIV8, 0x0);

    /* Enable TIM1 */
    TIM1_Cmd(ENABLE);

    /* Clear CC1 Flag*/
    TIM1_ClearFlag(TIM1_FLAG_CC3);
    TIM1_ClearFlag(TIM1_FLAG_CC4);

    /* wait a capture on CC4 */
    while(!TIM1_GetFlagStatus(TIM1_FLAG_CC3));
    /* Get CCR1 value*/
    ICValue1 = TIM1_GetCapture3();
    TIM1_ClearFlag(TIM1_FLAG_CC3);

    /* wait a capture on CC4 */
    while(!TIM1_GetFlagStatus(TIM1_FLAG_CC4));
    /* Get CCR1 value*/
    ICValue3 = TIM1_GetCapture4();
    TIM1_ClearFlag(TIM1_FLAG_CC4);

    /* wait a capture on cc1 */
    while(!TIM1_GetFlagStatus(TIM1_FLAG_CC3));
    /* Get CCR1 value*/
    ICValue2 = TIM1_GetCapture3();
    TIM1_ClearFlag(TIM1_FLAG_CC3);

    /* wait a capture on cc1 */
    while(!TIM1_GetFlagStatus(TIM1_FLAG_CC4));
    /* Get CCR1 value*/
    ICValue4 = TIM1_GetCapture4();
    TIM1_ClearFlag(TIM1_FLAG_CC4);
}

#ifdef USE_FULL_ASSERT

/**
 * @brief  Reports the name of the source file and the source line number
 *   where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval : None
 */
void assert_failed(u8* file, u32 line)
{
    /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

    /* Infinite loop */
    while (1)
    {
    }
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
